taberhuang/CMSIS-DAP-STM32F103C6/Firmware/CMSIS-DAP/DAP_config.h
/*
* Copyright (c) 2013-2017 ARM Limited. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the License); you may
* not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
* www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an AS IS BASIS, WITHOUT
* WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
* ----------------------------------------------------------------------
*
* $Date:        1. December 2017
* $Revision:    V2.0.0
*
* Project:      CMSIS-DAP Configuration
* Title:        DAP_config.h CMSIS-DAP Configuration File (Template)
*
*---------------------------------------------------------------------------*/

#ifndef __DAP_CONFIG_H__
#define __DAP_CONFIG_H__

#include <stdio.h>
#include <stddef.h>
#include <stdint.h>

extern void vResetTarget(uint8_t bit);

typedef const struct
{
  void  (* LedConnected)  (uint16_t);
  void  (* LedRunning)    (uint16_t);
} CoreDescriptor_t;

extern const CoreDescriptor_t * pCoreDescriptor;

typedef const struct
{
  void    (* UserInit)  (CoreDescriptor_t * core);
  uint32_t  (* UserProcess) (const uint8_t *, uint8_t *);
  void    (* UserAbort) (void);
} UserAppDescriptor_t;

#if  !defined ( BLUEPILL      )  \
  && !defined ( BOARD_V1      ) \
  && !defined ( BOARD_V2      ) \
  && !defined ( STLINK_V20    ) \
  && !defined ( STLINK_V21    ) \
  && !defined ( BOARD_STM32RF ) \
  && !defined ( STLINK_V2A    ) \
  && !defined ( STLINK_V2B    )
#error "Board undefined"
#endif

#if defined ( CDC_UART_USE_USART1_PA9_PA10 ) && defined ( SWO_PB7 )
#error "CDC_UART_USE_USART1_PA9_PA10 与 SWO_PB7 不能同时定义（共用 USART1）"
#endif

//**************************************************************************************************
/** 
\defgroup DAP_Config_Debug_gr CMSIS-DAP Debug Unit Information
\ingroup DAP_ConfigIO_gr 
@{
Provides definitions about:
- Definition of Cortex-M processor parameters used in CMSIS-DAP Debug Unit.
- Debug Unit communication packet size.
- Debug Access Port communication mode (JTAG or SWD).
- Optional information about a connected Target Device (for Evaluation Boards).
*/

#include <stm32f10x.h>

/// Processor Clock of the Cortex-M MCU used in the Debug Unit.
/// This value is used to calculate the SWD/JTAG clock speed.
#define CPU_CLOCK               72000000 ///< 72MHz, Specifies the CPU Clock in Hz

/// Number of processor cycles for I/O Port write operations.
/// This value is used to calculate the SWD/JTAG clock speed that is generated with I/O
/// Port write operations in the Debug Unit by a Cortex-M MCU. Most Cortex-M processors
/// requrie 2 processor cycles for a I/O Port Write operation.  If the Debug Unit uses
/// a Cortex-M0+ processor with high-speed peripheral I/O only 1 processor cycle might be 
/// requrired.
#define IO_PORT_WRITE_CYCLES    2       ///< I/O Cycles: 2=default, 1=Cortex-M0+ fast I/0

/// Indicate that Serial Wire Debug (SWD) communication mode is available at the Debug Access Port.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#define DAP_SWD                 1       ///< SWD Mode:  1 = available, 0 = not available

/// Indicate that JTAG communication mode is available at the Debug Port.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#if  defined ( BOARD_STM32RF ) \
  || defined ( STLINK_V20 )    \
  || defined ( STLINK_V21 )    \
  || defined ( STLINK_V2A )
#define DAP_JTAG                0       ///< JTAG Mode: 0 = not available, no JTAG pins.
#else
#define DAP_JTAG                1       ///< JTAG Mode: 1 = available, 0 = not available.
#endif

/// Configure maximum number of JTAG devices on the scan chain connected to the Debug Access Port.
/// This setting impacts the RAM requirements of the Debug Unit. Valid range is 1 .. 255.
#define DAP_JTAG_DEV_CNT        8       ///< Maximum number of JTAG devices on scan chain

/// Default communication mode on the Debug Access Port.
/// Used for the command \ref DAP_Connect when Port Default mode is selected.
#define DAP_DEFAULT_PORT        1       ///< Default JTAG/SWJ Port Mode: 1 = SWD, 2 = JTAG.

/// Default communication speed on the Debug Access Port for SWD and JTAG mode.
/// Used to initialize the default SWD/JTAG clock frequency.
/// The command \ref DAP_SWJ_Clock can be used to overwrite this default setting.
#define DAP_DEFAULT_SWJ_CLOCK   10000000 ///< 10MHz, Default SWD/JTAG clock frequency in Hz.

/// Maximum Package Size for Command and Response data.
/// This configuration settings is used to optimized the communication performance with the
/// debugger and depends on the USB peripheral. Change setting to 1024 for High-Speed USB.
#define DAP_PACKET_SIZE         64      ///< USB: 64 = Full-Speed, 1024 = High-Speed.

/// Maximum Package Buffers for Command and Response data.
/// This configuration settings is used to optimized the communication performance with the
/// debugger and depends on the USB peripheral. For devices with limited RAM or USB buffer the
/// setting can be reduced (valid range is 1 .. 255). Change setting to 4 for High-Speed USB.
#define DAP_PACKET_COUNT        16      ///< Buffers: 64 = Full-Speed, 4 = High-Speed.

/// Indicate that UART Serial Wire Output (SWO) trace is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#if defined ( CDC_UART_USE_USART1_PA9_PA10 )
#define SWO_UART                0       ///< USART1 用于 CDC 时关闭 SWO UART
#else
#define SWO_UART                1       ///< SWO UART:  1 = available, 0 = not available.
#endif

/// Maximum SWO UART Baudrate.
#define SWO_UART_MAX_BAUDRATE   1000000U  ///< 1MHz, SWO UART Maximum Baudrate in Hz.

/// Indicate that Manchester Serial Wire Output (SWO) trace is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
/// This function not ready in SWO.c !!!!!, should be 0 = (not available)
#define SWO_MANCHESTER          0       ///< SWO Manchester:  1 = available, 0 = not available.

/// SWO Trace Buffer Size.
#define SWO_BUFFER_SIZE         4096U   ///< SWO Trace Buffer Size in bytes (must be 2^n).

