taberhuang/CMSIS-DAP-STM32F103C6/Firmware/CMSIS-DAP/DAP_config.h
/// SWO Streaming Trace.
#define SWO_STREAM              0       ///< SWO Streaming Trace: 1 = available, 0 = not available.

/// Clock frequency of the Test Domain Timer. Timer value is returned with \ref TIMESTAMP_GET.
#define TIMESTAMP_CLOCK         SystemCoreClock ///< 72MHz, Timestamp clock in Hz (0 = timestamps not supported).

/// Debug Unit is connected to fixed Target Device.
/// The Debug Unit may be part of an evaluation board and always connected to a fixed
/// known device.  In this case a Device Vendor and Device Name string is stored which
/// may be used by the debugger or IDE to configure device parameters.
#define TARGET_DEVICE_FIXED     0       ///< Target Device: 1 = known, 0 = unknown;

#if TARGET_DEVICE_FIXED
#define TARGET_DEVICE_VENDOR    ""    ///< String indicating the Silicon Vendor
#define TARGET_DEVICE_NAME      ""    ///< String indicating the Target Device
#endif

///@}

#define GPIO_INIT(port, data) GPIO_Init(port, (GPIO_InitTypeDef *)&data)
#define PIN_MODE_MASK(pin)    (((uint32_t)0x0F) << ((pin) << 2))
#define PIN_MODE(mode,pin)    (((uint32_t)mode) << ((pin) << 2))
#define PIN_MASK(pin)         (((uint16_t)0x01) << (pin))

typedef enum Pin_e {
  PA = 0x00, PA0 = 0x00, PA1, PA2, PA3, PA4, PA5, PA6, PA7, PA8, PA9, PA10, PA11, PA12, PA13, PA14, PA15,
  PB = 0x10, PB0 = 0x10, PB1, PB2, PB3, PB4, PB5, PB6, PB7, PB8, PB9, PB10, PB11, PB12, PB13, PB14, PB15,
  PC = 0x20, PC0 = 0x20, PC1, PC2, PC3, PC4, PC5, PC6, PC7, PC8, PC9, PC10, PC11, PC12, PC13, PC14, PC15,
  PD = 0x30, PD0 = 0x30, PD1, PD2,
} Pin_t;

/*
 * USB-CDC 虚拟串口所用 UART 与 PA9~PA13 的关系（STM32F103）：
 * - 仅 PA9(TX)+PA10(RX) 可做 USART1 标准异步 TX/RX，本工程在 CDC_UART_USE_USART1_PA9_PA10 时采用。
 * - PA11、PA12：片上 USB D-/D+，与 USB 设备功能冲突，不能当普通 UART。
 * - PA13、PA14：MCU SWD 调试口，不能当应用 CDC 串口。
 * 默认（未定义 CDC_UART_USE_USART1_PA9_PA10）：USART2 + PA2/PA3，USART1 留给 SWO（SWO_PB7 等）。
 */
#if defined ( CDC_UART_USE_USART1_PA9_PA10 )

#define USART_CDC_CLOCK(state)      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, state)
#define USART_CDC_GPIO_CLOCK(state) RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, state)
#define USART_CDC_REMAP()           ((void)0)

#define USART_CDC_PORT        1     /* USART1 */
#define USART_CDC_GPIO        GPIOA
#define USART_CDC_TX_PIN_MASK GPIO_Pin_9
#define USART_CDC_RX_PIN_MASK GPIO_Pin_10
#define USART_CDC_IRQn        USART1_IRQn
#define USART_CDC_IRQHandler  USART1_IRQHandler
#define USART_CDC_BUFFER_SIZE (1024)

#else

#define USART_CDC_CLOCK(state)      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, state)
#define USART_CDC_GPIO_CLOCK(state) RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, state)
#define USART_CDC_REMAP()           /* GPIO_PinRemapConfig(..., ENABLE) */

#define USART_CDC_PORT        2     /* USART2 */
#define USART_CDC_GPIO        GPIOA
#define USART_CDC_TX_PIN_MASK GPIO_Pin_2
#define USART_CDC_RX_PIN_MASK GPIO_Pin_3
#define USART_CDC_IRQn        USART2_IRQn
#define USART_CDC_IRQHandler  USART2_IRQHandler
#define USART_CDC_BUFFER_SIZE (1024)  /*  Size of Receive and Transmit buffers MUST BE 2^n */

#endif

// USB Connect Pull-Up

#if   defined ( BLUEPILL ) \
  ||  defined ( BOARD_V1 ) \
  ||  defined ( BOARD_V2 )

#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPAEN
#define PIN_USB_CONNECT_PORT  GPIOA
#define PIN_USB_CONNECT_PIN   8
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_PP
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK

#elif  defined ( STLINK_V20 ) \
  ||   defined ( STLINK_V2A ) \
  ||   defined ( STLINK_V2B )

#define PIN_USB_CONNECT_ON()
#define PIN_USB_CONNECT_OFF()

#elif defined ( STLINK_V21 )

#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPAEN
#define PIN_USB_CONNECT_PORT  GPIOA
#define PIN_USB_CONNECT_PIN   15
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_OD
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK

#elif defined ( BOARD_STM32RF )

// USB Connect Pull-Up
#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPBEN
#define PIN_USB_CONNECT_PORT  GPIOB
#define PIN_USB_CONNECT_PIN   5
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_PP
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK
#endif

#if defined ( BLUEPILL )              //New STM32F103C8T6 - Bluepill Board

#if defined ( SWD_REMAP )             //remap SWDIO/SWCLK to PA13/PA14

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         5

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA   //remapped
#define PIN_SWDIO_TMS_PIN   13

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA   //remapped
#define PIN_SWCLK_TCK_PIN   14

// TDO/SWO Pin (input)              //remap USART1_Rx_Pin to PB7 for SWO
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOA
#define PIN_nRESET_PIN      7

#else //#if defined ( SWD_REMAP )

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         5

// SWDIO/TMS Pin（若 CDC 仍用 USART2/PA2，不可使用本脚位作 SWDIO）
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   2

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   4

// TDO/SWO Pin (input)              //remap USART1_Rx_Pin to PB7 for SWO
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOA
#define PIN_nRESET_PIN      7

#endif //#if defined ( SWD_REMAP )

#elif defined ( BOARD_V1 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   2         //PA2 conflict with USART2
#error "PA2 conflict with USART2, Please remove USART-CDC function or change PIN_SWDIO_TMS_PIN!!!!"

