taberhuang/CMSIS-DAP-STM32F103C6/Firmware/CMSIS-DAP/DAP_config.h
// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   4

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         5

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOA
#define PIN_TDI_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOA
#define PIN_nRESET_PIN      6

#elif defined ( BOARD_V2 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   4

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   5

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         6

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOA
#define PIN_TDI_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      9

#elif defined ( STLINK_V20 ) \
   || defined ( STLINK_V21 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOB
#define PIN_SWDIO_TMS_PIN   14

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOB
#define PIN_SWCLK_TCK_PIN   13

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      0

#elif defined ( BOARD_STM32RF )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   6

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   7

// TDO/SWO Pin (input)

#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      9

#elif defined ( STLINK_V2A ) \
  ||  defined ( STLINK_V2B )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOB
#define PIN_SWDIO_TMS_PIN   14

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOB
#define PIN_SWCLK_TCK_PIN   13

#if defined ( SWO_PB7 )
// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOB    //remap USART1_Rx_Pin to PB7 for SWO
#define PIN_TDO_PIN         7

#elif defined ( SWO_PA10 )
// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         10
#else
#error "SWO Pin undefined, please define SWO_PA10 or SWO_PB7 for your board."
#endif

// TDI Pin (output), STLINK_V2B use only
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         8

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      6

#endif

// Debug Unit LEDs
#if defined ( BLUEPILL )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN // PB0 - Connected
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   0

#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN // PB8 - Running
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     8

#elif defined ( BOARD_V1 ) || defined ( BOARD_V2 )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN

// Connected LED (GREEN)
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   13

// Target Running LED (RED)
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     12

#elif defined ( STLINK_V20 ) \
  ||  defined ( STLINK_V2A ) \
  ||  defined ( STLINK_V2B )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPAEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPAEN

// Connected LED (GREEN)  0
// Target Running LED (RED) 1
// Off - float
#define LED_CONNECTED_PORT  GPIOA
#define LED_CONNECTED_PIN   9

#define LED_RUNNING_PORT    GPIOA
#define LED_RUNNING_PIN     9

#elif defined ( STLINK_V21 )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPAEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPAEN

// Connected LED (GREEN)  0
// Target Running LED (RED) 1
// Off - float
#define LED_CONNECTED_PORT  GPIOA
#define LED_CONNECTED_PIN   9

#define LED_RUNNING_PORT    GPIOA
#define LED_RUNNING_PIN     8

//  #define LED_CONNECTED_MASK  PIN_MASK(LED_CONNECTED_PIN)
//  #define LED_RUNNING_MASK    PIN_MASK(LED_RUNNING_PIN)

#elif defined ( BOARD_STM32RF )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN

// Connected LED (GREEN)
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   11

// Target Running LED (RED)
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     12

#endif

#define LED_CONNECTED_MASK      PIN_MASK(LED_CONNECTED_PIN)
#define LED_RUNNING_MASK        PIN_MASK(LED_RUNNING_PIN)

#define PIN_nRESET_MASK         PIN_MASK(PIN_nRESET_PIN)
#define PIN_SWDIO_TMS_MASK      PIN_MASK(PIN_SWDIO_TMS_PIN)
#define PIN_SWCLK_TCK_MASK      PIN_MASK(PIN_SWCLK_TCK_PIN)
#define PIN_TDI_MASK            PIN_MASK(PIN_TDI_PIN)
#define PIN_TDO_MASK            PIN_MASK(PIN_TDO_PIN)

#if (PIN_nRESET_PIN >= 8)
#define PIN_nRESET_LOW()              \
  do {                      \
    /* GPIO_Mode_Out_OD | GPIO_Speed_50MHz */ \
    PIN_nRESET_PORT->CRH = (PIN_nRESET_PORT->CRH & ~PIN_MODE_MASK(PIN_nRESET_PIN - 8))  \
    | PIN_MODE(((GPIO_Mode_Out_OD | GPIO_Speed_50MHz) & 0x0F), PIN_nRESET_PIN - 8); \
    PIN_nRESET_PORT->BRR = PIN_nRESET_MASK; \
  } while (0)

#define PIN_nRESET_HIGH()             \
  do {                      \
    PIN_nRESET_PORT->BSRR = PIN_nRESET_MASK; \
    PIN_nRESET_PORT->CRH = (PIN_nRESET_PORT->CRH & ~PIN_MODE_MASK(PIN_nRESET_PIN - 8))  \
    | PIN_MODE(GPIO_Mode_IPU, PIN_nRESET_PIN - 8);    \
  } while (0)
#else
#define PIN_nRESET_LOW()              \
  do {                      \
    /* GPIO_Mode_Out_OD | GPIO_Speed_50MHz */ \
    PIN_nRESET_PORT->CRL = (PIN_nRESET_PORT->CRL & ~PIN_MODE_MASK(PIN_nRESET_PIN))  \
    | PIN_MODE(((GPIO_Mode_Out_OD | GPIO_Speed_50MHz) & 0x0F), PIN_nRESET_PIN); \
    PIN_nRESET_PORT->BRR = PIN_nRESET_MASK; \
  } while (0)

#define PIN_nRESET_HIGH()             \
  do {                      \
    PIN_nRESET_PORT->BSRR = PIN_nRESET_MASK; \
    PIN_nRESET_PORT->CRL = (PIN_nRESET_PORT->CRL & ~PIN_MODE_MASK(PIN_nRESET_PIN))  \
    | PIN_MODE(GPIO_Mode_IPU, PIN_nRESET_PIN);    \
  } while (0)
#endif

//  For fast switch between input and output mode
//  without GPIO_Init call
#if (PIN_SWDIO_TMS_PIN >= 8)

#define PIN_SWDIO_TMS_OUT_DISABLE()         \
  do {                      \
    PIN_SWDIO_TMS_PORT->CRH = (PIN_SWDIO_TMS_PORT->CRH & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN - 8)) | PIN_MODE(0x8, PIN_SWDIO_TMS_PIN - 8); \
    PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS_MASK;  \
  } while (0)

#define PIN_SWDIO_TMS_OUT_ENABLE()          \
  do {                      \
    PIN_SWDIO_TMS_PORT->CRH = (PIN_SWDIO_TMS_PORT->CRH & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN - 8)) | PIN_MODE(0x3, PIN_SWDIO_TMS_PIN - 8); \
    PIN_SWDIO_TMS_PORT->BRR  = PIN_SWDIO_TMS_MASK;  \
  } while (0)

#else

#define PIN_SWDIO_TMS_OUT_DISABLE()         \
  do {                      \
    PIN_SWDIO_TMS_PORT->CRL = (PIN_SWDIO_TMS_PORT->CRL & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN)) | PIN_MODE(0x8, PIN_SWDIO_TMS_PIN); \
    PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS_MASK;  \
  } while (0)

#define PIN_SWDIO_TMS_OUT_ENABLE()          \
  do {                      \
    PIN_SWDIO_TMS_PORT->CRL = (PIN_SWDIO_TMS_PORT->CRL & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN)) | PIN_MODE(0x3, PIN_SWDIO_TMS_PIN); \
    PIN_SWDIO_TMS_PORT->BRR  = PIN_SWDIO_TMS_MASK;  \
  } while (0)

