taberhuang/CMSIS-DAP-STM32F103C6/Firmware/CMSIS-DAP/DAP_config.h
#endif //#if (PIN_SWDIO_TMS_PIN >= 8)


void PORT_USB_CONNECT_SETUP(void);
void LEDS_SETUP (void);

//**************************************************************************************************
/** 
\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
\ingroup DAP_ConfigIO_gr 
@{

Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug 
interface of a device. The following I/O Pins are provided:

JTAG I/O Pin                 | SWD I/O Pin          | CMSIS-DAP Hardware pin mode
---------------------------- | -------------------- | ---------------------------------------------
TCK: Test Clock              | SWCLK: Clock         | Output Push/Pull
TMS: Test Mode Select        | SWDIO: Data I/O      | Output Push/Pull; Input (for receiving data)
TDI: Test Data Input         |                      | Output Push/Pull
TDO: Test Data Output        |                      | Input             
nTRST: Test Reset (optional) |                      | Output Open Drain with pull-up resistor
nRESET: Device Reset         | nRESET: Device Reset | Output Open Drain with pull-up resistor


DAP Hardware I/O Pin Access Functions
-------------------------------------
The various I/O Pins are accessed by functions that implement the Read, Write, Set, or Clear to 
these I/O Pins. 

For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO 
peripherals that can independently write/read a single I/O pin without affecting any other pins 
of the same I/O port. The following SWDIO I/O Pin functions are provided:
- \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
- \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
- \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
- \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/


// Configure DAP I/O pins ------------------------------

void PORT_JTAG_SETUP(void);
void PORT_SWD_SETUP(void);
void PORT_OFF(void);

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the 
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
- I/O clock system enabled.
- all I/O pins: input buffer enabled, output pins are set to HighZ mode.
- for nTRST, nRESET a weak pull-up (if available) is enabled.
- LED output pins are enabled and LEDs are turned off.

*/
#define DAP_SETUP() PORT_OFF()

// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_SWCLK_TCK_IN(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  return (PIN_SWCLK_TCK_PORT->ODR & PIN_SWCLK_TCK_MASK) ? 1 : 0;
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_INLINE void PIN_SWCLK_TCK_SET(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWCLK_TCK_PORT->BSRR = PIN_SWCLK_TCK_MASK;
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_INLINE void PIN_SWCLK_TCK_CLR (void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWCLK_TCK_PORT->BRR = PIN_SWCLK_TCK_MASK;
}

// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_SWDIO_TMS_IN(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  return (PIN_SWDIO_TMS_PORT->IDR & PIN_SWDIO_TMS_MASK) ? 1 : 0;
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_INLINE void PIN_SWDIO_TMS_SET(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS_MASK;
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_INLINE void PIN_SWDIO_TMS_CLR(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWDIO_TMS_PORT->BRR = PIN_SWDIO_TMS_MASK;
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_SWDIO_IN (void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  if (PIN_SWDIO_TMS_PORT->IDR & PIN_SWDIO_TMS_MASK)
  return 1;
  return 0;
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_INLINE void PIN_SWDIO_OUT(uint8_t bit)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  if (bit & 1)
  PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS_MASK;
  else
  PIN_SWDIO_TMS_PORT->BRR  = PIN_SWDIO_TMS_MASK;
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_INLINE void PIN_SWDIO_OUT_ENABLE(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWDIO_TMS_OUT_ENABLE();
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_INLINE void PIN_SWDIO_OUT_DISABLE(void)
{
#if defined ( BLUEPILL ) && defined ( SWD_REMAP )
  AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_DISABLE;
#endif
  
  PIN_SWDIO_TMS_OUT_DISABLE();
}

// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_TDI_IN(void)
{
#if ( DAP_JTAG != 0 )
  return (PIN_TDI_PORT->ODR & PIN_TDI_MASK) ? 1 : 0;
#else
  return (0);
#endif
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_INLINE void PIN_TDI_OUT(uint8_t bit)
{
#if ( DAP_JTAG != 0 )
  if (bit & 1)
  PIN_TDI_PORT->BSRR = PIN_TDI_MASK;
  else
  PIN_TDI_PORT->BRR  = PIN_TDI_MASK;
#endif
}

// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_TDO_IN(void)
{
#if ( DAP_JTAG != 0 )
  return (PIN_TDO_PORT->IDR & PIN_TDO_MASK) ? 1 : 0;
#else
  return (0);
#endif
}

// nTRST Pin I/O -------------------------------------------

