taberhuang/CMSIS-DAP-STM32F103C6/Firmware/CMSIS-DAP/DAP_config.h
/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_nTRST_IN(void)
{
  return (0);   // Not available
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
          - 0: issue a JTAG TRST Test Reset.
          - 1: release JTAG TRST Test Reset.
*/
__STATIC_INLINE void PIN_nTRST_OUT(uint8_t bit)
{
  // Not available
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
__STATIC_INLINE uint8_t PIN_nRESET_IN(void)
{
  return (PIN_nRESET_PORT->IDR & PIN_nRESET_MASK) ? 1 : 0;
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
          - 0: issue a device hardware reset.
          - 1: release device hardware reset.
*/
//__STATIC_INLINE void PIN_nRESET_OUT(uint8_t bit)
#define PIN_nRESET_OUT(b) vResetTarget(b)

///@}

/** 
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

It is recommended to provide the following LEDs for status indication:
- Connect LED: is active when the DAP hardware is connected to a debugger.
- Running LED: is active when the debugger has put the target device into running state.
*/
/** Debug Unit: Set status of Connected LED.
\param bit status of the Connect LED.
          - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
          - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
*/
#define LED_CONNECTED_OUT(b)  pCoreDescriptor->LedConnected(b)

/** Debug Unit: Set status Target Running LED.
\param bit status of the Target Running LED.
          - 1: Target Running LED ON: program execution in target started.
          - 0: Target Running LED OFF: program execution in target stopped.
*/
#define LED_RUNNING_OUT(b)    pCoreDescriptor->LedRunning(b)

///@}

/** 
\defgroup DAP_Config_Timestamp_gr CMSIS-DAP Timestamp
\ingroup DAP_ConfigIO_gr
@{
Access function for Test Domain Timer.

The value of the Test Domain Timer in the Debug Unit is returned by the function \ref TIMESTAMP_GET. By 
default, the DWT timer is used.  The frequency of this timer is configured with \ref TIMESTAMP_CLOCK.
*/

/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
static __inline uint32_t TIMESTAMP_GET (void) {
  return (DWT->CYCCNT);
}

///@}

/** 
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required 
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint8_t RESET_TARGET(void)
{
  return (1); // change to '1' when a device reset sequence is implemented
}

///@}

#endif /* __DAP_CONFIG_H__ */
